---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidTargetPositionError
source: html/f3c65c44-5cf7-2b20-1dcf-a5f424ea09d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidTargetPositionError Property

Joining the highlighted wall to the highlighted element moves the wall's top below its bottom or its bottom above its top, or interferes with wall joins or holes in the wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidTargetPositionError { get; }
```